---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.StartOfBar
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.StartOfBar

Handle controlling start point of the Rebar.